{
  "backend/main.mo": "Defines backend actor with data types, maps, authorization mixin, rate limiting, and user profile management endpoints.",
  "feature_evidence.json": "Feature evidence report describing an admin access-denied UX improvement and listing related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including pages, components, hooks, and configuration.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and global base styles.",
  "frontend/index.html": "Minimal HTML entry point bootstrapping the React app via main.tsx.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and linking to the sitemap.",
  "frontend/public/sitemap.xml": "XML sitemap listing main site routes with change frequency and priority hints.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps the app in ThemeProvider, and includes a global Toaster.",
  "frontend/src/components/admin/AdminAccessDenied.tsx": "UI component showing an access-denied message with retry, sign-out, and home navigation actions.",
  "frontend/src/components/admin/AdminGate.tsx": "Auth gate that handles II login, admin permission checks, retry logic, profile setup, and gated rendering.",
  "frontend/src/components/admin/AdminLoginPanel.tsx": "Login panel prompting Internet Identity authentication with loading states and admin-only notice.",
  "frontend/src/components/admin/backup/BackupRestorePanel.tsx": "Panel for exporting site data to JSON and importing backups with preview and validation.",
  "frontend/src/components/admin/pages/PagesAdminPanel.tsx": "Admin interface to list, create, edit, and delete custom pages with metadata.",
  "frontend/src/components/admin/ProfileSetupDialog.tsx": "Modal form for setting admin profile, using a mutation to save name and email with error handling.",
  "frontend/src/components/admin/promotions/PromotionsAdminPanel.tsx": "Admin panel to manage promotional banners, including add, edit, reorder, and delete actions.",
  "frontend/src/components/admin/settings/ActionButtonsAdminPanel.tsx": "Settings UI to configure WhatsApp, call, and order action buttons and save updates.",
  "frontend/src/components/admin/settings/SiteSettingsAdminPanel.tsx": "Panel for editing location/contact info and managing opening hours with add/remove operations.",
  "frontend/src/components/branding/Section.tsx": "Provides a Section wrapper with optional patterned background and a SectionHeader component for titles and subtitles.",
  "frontend/src/components/FindUs/GoogleMapEmbed.tsx": "Embeds a responsive Google Maps iframe using the centralized config URL.",
  "frontend/src/components/forms/CateringEventForm.tsx": "Implements a catering event request form with field validation and submission using a mutation hook.",
  "frontend/src/components/forms/ContactForm.tsx": "Implements a basic contact form with validation and async submission via a mutation hook.",
  "frontend/src/components/forms/ReservationForm.tsx": "Handles restaurant reservation submissions with validation, guest count, and optional special requests.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Displays a responsive image grid that opens a selected item in a lightbox.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Renders a modal lightbox for gallery images with navigation controls and keyboard support.",
  "frontend/src/components/home/FeaturedCategoryGrid.tsx": "Shows a grid of predefined menu categories with icons, descriptions, and a link to the menu page.",
  "frontend/src/components/layout/SiteFooter.tsx": "Builds the site footer with branding, quick links, contact info, hours, and dynamic custom pages.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with logo, dynamic navigation links, and mobile menu using custom pages.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main page layout including header, promotions strip, routed content, and footer.",
  "frontend/src/components/menu/MenuFilters.tsx": "Category filter tabs for menu items with support for selecting and changing categories.",
  "frontend/src/components/menu/MenuList.tsx": "Displays menu items in a responsive card grid with prices, descriptions, and tags.",
  "frontend/src/components/promotions/PromotionsStrip.tsx": "Shows active promotions in dismissible alerts sorted by order.",
  "frontend/src/config/site.ts": "Static site configuration containing contact info, hours, social links, and metadata.",
  "frontend/src/data/gallery.ts": "Static gallery item definitions with images, captions, and categories.",
  "frontend/src/data/menu.ts": "Defines menu categories and a full list of menu items with descriptions, prices, and tags.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminPages.ts": "Mutations for creating, updating, and deleting custom pages with cache invalidation.",
  "frontend/src/hooks/useAdminPromotions.ts": "Admin queries and mutations for managing promotions including add, update, delete, and fetch.",
  "frontend/src/hooks/useAdminSiteSettings.ts": "Admin mutations for location, opening hours, and button configuration with cache updates.",
  "frontend/src/hooks/useAdminStatus.ts": "Provides hooks to query admin status and fetch the caller’s user profile via the actor.",
  "frontend/src/hooks/useBackupRestore.ts": "Defines mutations for exporting and importing backend data, invalidating queries after import.",
  "frontend/src/hooks/useCustomPages.ts": "Fetches all custom pages or a single page by slug through actor-based queries.",
  "frontend/src/hooks/useGalleryData.ts": "Returns static gallery data via a query, prepared for future backend integration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing login, identity state, and AuthClient setup.",
  "frontend/src/hooks/useMenuData.ts": "Provides static menu and category data through a query, ready for backend integration later.",
  "frontend/src/hooks/usePageSeo.ts": "Fetches static SEO config for a given page key using a query.",
  "frontend/src/hooks/usePromotions.ts": "Queries the backend for active promotions using the actor.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations for submitting contact forms, reservations, and catering events, with query invalidation.",
  "frontend/src/hooks/useSiteSettings.ts": "Fetches location, opening hours, and button configs from the actor with fallbacks for location data.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining light/dark palettes and utility classes.",
  "frontend/src/main.tsx": "Sets up the app root with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, branding sections, and descriptive content about the restaurant.",
  "frontend/src/pages/admin/AdminPage.tsx": "Admin dashboard with authentication gate, tabs for site management, and logout handling.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with a form, location details, opening hours, and SEO plus JSON-LD data.",
  "frontend/src/pages/CustomPage.tsx": "Loads and displays custom CMS pages by slug with SEO handling and fallback states.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery page with SEO and a grid of images fetched from gallery data.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, featured categories, and promotional sections using SEO config.",
  "frontend/src/pages/MenuPage.tsx": "Displays menu items with category filters and applies menu-specific SEO metadata.",
  "frontend/src/pages/OrderReservePage.tsx": "Provides reservation and catering request forms via tabbed UI with associated SEO settings.",
  "frontend/src/seo/LocalBusinessJsonLd.tsx": "Generates and injects JSON-LD structured data for the restaurant using site settings.",
  "frontend/src/seo/seoConfig.ts": "Defines default and per-page SEO configurations using site metadata.",
  "frontend/src/seo/useSeo.ts": "React hook that sets document title, meta tags, canonical URL, and social preview tags.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, storing, and clearing URL and sessionStorage parameters, with support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color system, typography, animations, and plugins for the frontend.",
  "project_state.json": "JSON file describing project metadata, requirements, architecture notes, features, and known issues for the restaurant website build."
}