{
  "backend/main.mo": "Defines types and implements backend storage, rate limiting, user profiles, and access control using persistent authorization state.",
  "feature_evidence.json": "Feature evidence report describing admin/auth messaging requirements and the related frontend file.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend components, pages, data files, and SEO utilities.",
  "frontend/index.css": "Tailwind CSS base theme variables and dark mode tokens defining the app’s color system and global styles.",
  "frontend/index.html": "Base HTML entry file loading the React app and main script.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing the sitemap URL.",
  "frontend/public/sitemap.xml": "Static sitemap listing main site URLs with change frequency and priority.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps the app with ThemeProvider, and renders the router and Toaster.",
  "frontend/src/components/admin/AdminAccessCodePanel.tsx": "Admin access code entry panel storing the token in session storage and reloading to trigger auth initialization.",
  "frontend/src/components/admin/AdminAccessDenied.tsx": "Admin access denied screen with retry, sign-out, return-home options, plus the access code entry panel.",
  "frontend/src/components/admin/AdminGate.tsx": "Controls admin access flow, handling authentication, admin checks, profile setup, and loading states before rendering children.",
  "frontend/src/components/admin/AdminLoginPanel.tsx": "Displays an Internet Identity login UI for administrators with a sign‑in button and loading state.",
  "frontend/src/components/admin/backup/BackupRestorePanel.tsx": "Provides backup export and import tools with JSON preview, file download, validation, and restore actions.",
  "frontend/src/components/admin/pages/PagesAdminPanel.tsx": "CRUD interface for creating, editing, and deleting custom pages, including metadata and content.",
  "frontend/src/components/admin/ProfileSetupDialog.tsx": "Modal prompting new admins to enter profile details and save them via a mutation.",
  "frontend/src/components/admin/promotions/PromotionsAdminPanel.tsx": "CRUD interface for managing promotional banners, including creation, editing, ordering, and deletion.",
  "frontend/src/components/admin/settings/ActionButtonsAdminPanel.tsx": "Admin UI for viewing, editing, and saving WhatsApp, call, and order button configurations.",
  "frontend/src/components/admin/settings/SiteSettingsAdminPanel.tsx": "Admin panel for updating location details and managing opening hours with add/remove functionality.",
  "frontend/src/components/branding/Section.tsx": "Reusable layout components for page sections and headers with optional patterns and styling.",
  "frontend/src/components/FindUs/GoogleMapEmbed.tsx": "Embeds a responsive Google Maps iframe using the configured URL.",
  "frontend/src/components/forms/CateringEventForm.tsx": "Form for submitting catering event requests with validation, mutation handling, and success/error alerts.",
  "frontend/src/components/forms/ContactForm.tsx": "Contact form handling name, email, and message submission with validation and mutation feedback.",
  "frontend/src/components/forms/ReservationForm.tsx": "Reservation request form for collecting guest info, date, and special requests with validation.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Image grid that displays gallery items and opens a lightbox when an image is selected.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "No summary available.",
  "frontend/src/components/home/FeaturedCategoryGrid.tsx": "Renders a grid of predefined food categories with icons and links to the menu.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing brand info, quick links, contact details, hours, and social links with dynamic custom pages.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation links, custom pages, logo, and mobile drawer menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapping header, promotions strip, routed content, and footer.",
  "frontend/src/components/menu/MenuFilters.tsx": "Category filter tabs allowing selection of menu categories including 'all'.",
  "frontend/src/components/menu/MenuList.tsx": "Grid list of menu items showing name, price, description, and optional tags.",
  "frontend/src/components/promotions/PromotionsStrip.tsx": "Displays active promotions with dismiss controls ordered by priority.",
  "frontend/src/config/site.ts": "Static site configuration including contact info, hours, social links, and metadata.",
  "frontend/src/data/gallery.ts": "Defines the GalleryItem type and provides sample gallery image data.",
  "frontend/src/data/menu.ts": "Defines menu categories and static menu items with metadata for use in the UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminPages.ts": "Provides mutations for creating, updating, and deleting custom pages, invalidating related queries on success.",
  "frontend/src/hooks/useAdminPromotions.ts": "Implements CRUD hooks for promotions, including fetching all promotions and invalidating caches after updates.",
  "frontend/src/hooks/useAdminSiteSettings.ts": "Contains mutations for updating site settings like location, opening hours, and button configs with query invalidation.",
  "frontend/src/hooks/useAdminStatus.ts": "Fetches admin status and current user profile using the actor, handling unauthorized responses gracefully.",
  "frontend/src/hooks/useBackupRestore.ts": "Provides export and import mutation hooks for full data backup and restoration with global query invalidation.",
  "frontend/src/hooks/useCustomPages.ts": "Fetches all custom pages or a single page by slug using backend actor methods.",
  "frontend/src/hooks/useGalleryData.ts": "Returns static gallery data via React Query as a placeholder for future backend integration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing identity, login/logout, and status tracking.",
  "frontend/src/hooks/useMenuData.ts": "Serves static menu categories and items through React Query until backend menu CRUD is added.",
  "frontend/src/hooks/usePageSeo.ts": "Returns static SEO config for a given page key via React Query with future backend support planned.",
  "frontend/src/hooks/usePromotions.ts": "Fetches currently active promotions from the backend actor with placeholder fallback behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for submitting contact, reservation, and catering event data using an actor and invalidates related query caches.",
  "frontend/src/hooks/useSiteSettings.ts": "Provides queries to fetch site location, opening hours, and button configurations with placeholder data when the actor is unavailable.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines custom CSS variables for light and dark themes, including color palettes and background patterns.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO settings and structured sections describing the restaurant's story, mission, cuisine, and services.",
  "frontend/src/pages/admin/AdminPage.tsx": "Defines the admin dashboard with authentication, logout handling, and multiple admin panels organized into tabs.",
  "frontend/src/pages/ContactPage.tsx": "Displays the contact page with a form, SEO metadata, business schema, and dynamic contact and opening hour details.",
  "frontend/src/pages/CustomPage.tsx": "Fetches and renders custom CMS-style pages by slug with SEO metadata and loading or not‑found states.",
  "frontend/src/pages/GalleryPage.tsx": "Shows the gallery page with SEO settings and a grid of images loaded via gallery data hooks.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, featured categories, and highlights of the restaurant's offerings using SEO metadata.",
  "frontend/src/pages/MenuPage.tsx": "Implements a menu page with filters, SEO metadata, and dynamically filtered menu items loaded from a data hook.",
  "frontend/src/pages/OrderReservePage.tsx": "Renders a reservations and catering page with SEO setup and tabbed forms for table reservations and catering requests.",
  "frontend/src/seo/LocalBusinessJsonLd.tsx": "Generates and injects JSON-LD structured data for the restaurant using site settings and fallback values.",
  "frontend/src/seo/seoConfig.ts": "Provides default and per-page SEO configurations including titles, descriptions, keywords, and Open Graph images.",
  "frontend/src/seo/useSeo.ts": "React hook that updates document title and meta tags for SEO, Open Graph, Twitter cards, and canonical URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in session storage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Metadata describing project state, requirements, architectural notes, existing features, and known issues such as admin access failures."
}