{
  "backend/main.mo": "Actor defining data types and storing contacts, reservations, events, pages, promotions, and user profiles with access control and rate limiting.",
  "feature_evidence.json": "Feature evidence metadata listing admin‑text requirements, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS entry defining design tokens, dark mode variables, and base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and pointing to sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing key site URLs with priorities and change frequencies.",
  "frontend/src/App.tsx": "Main React router setup configuring routes, layout, theming, and toaster.",
  "frontend/src/components/admin/AdminAccessDenied.tsx": "UI component showing English‑only admin access‑denied messaging with retry, sign‑out, and home options.",
  "frontend/src/components/admin/AdminGate.tsx": "Auth gate handling II login state, admin checks, profile state, and routing to login or access‑denied views.",
  "frontend/src/components/admin/AdminLoginPanel.tsx": "Login panel prompting Internet Identity sign‑in with loading state UI.",
  "frontend/src/components/admin/backup/BackupRestorePanel.tsx": "Panel for exporting data to JSON files and importing backups with preview, validation, and confirmation dialogs.",
  "frontend/src/components/admin/pages/PagesAdminPanel.tsx": "Admin interface to list, create, edit, and delete custom pages with metadata using modal dialogs and mutations.",
  "frontend/src/components/admin/ProfileSetupDialog.tsx": "Dialog that collects and saves the admin’s name and email using a mutation and shows errors or loading state.",
  "frontend/src/components/admin/promotions/PromotionsAdminPanel.tsx": "Panel for managing promotional banners, supporting create, edit, reorder, toggle active state, and delete operations.",
  "frontend/src/components/admin/settings/ActionButtonsAdminPanel.tsx": "Allows configuring WhatsApp, call, and order action buttons, including labels, links, and enabled state.",
  "frontend/src/components/admin/settings/SiteSettingsAdminPanel.tsx": "Admin settings for updating location details and managing opening hours with add and remove actions.",
  "frontend/src/components/branding/Section.tsx": "Provides styled Section and SectionHeader components with optional pattern, layout spacing, and centered headers.",
  "frontend/src/components/FindUs/GoogleMapEmbed.tsx": "Responsive iframe embedding Google Maps using centralized config.",
  "frontend/src/components/forms/CateringEventForm.tsx": "Form for submitting catering event requests with validation, mutation handling, and success/error alerts.",
  "frontend/src/components/forms/ContactForm.tsx": "Simple contact form with validation and async submission using a mutation hook.",
  "frontend/src/components/forms/ReservationForm.tsx": "Reservation request form validating user details and submitting via mutation with status alerts.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Displays a responsive image grid and opens a lightbox when an image is clicked.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Lightbox modal for viewing gallery images with navigation buttons and keyboard controls.",
  "frontend/src/components/home/FeaturedCategoryGrid.tsx": "Grid of predefined featured food categories linking to the menu page.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer showing branding, quick links, contact details, hours, and social links using site settings data.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the site header with dynamic navigation links, logo, and responsive mobile menu using custom pages.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including header, promotions strip, content outlet, and footer.",
  "frontend/src/components/menu/MenuFilters.tsx": "Provides tab-based category filters for the menu, allowing selection of predefined categories.",
  "frontend/src/components/menu/MenuList.tsx": "Displays menu items as cards with names, descriptions, prices, and tags, handling empty states.",
  "frontend/src/components/promotions/PromotionsStrip.tsx": "Shows active promotions in a dismissible strip ordered by priority.",
  "frontend/src/config/site.ts": "Exports static site configuration including contact info, address, hours, social links, and metadata.",
  "frontend/src/data/gallery.ts": "Contains gallery item definitions and a set of predefined images with captions and categories.",
  "frontend/src/data/menu.ts": "Defines menu categories and sample menu items with pricing, descriptions, and tags.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminPages.ts": "Provides mutations for creating, updating, and deleting custom pages with query invalidation.",
  "frontend/src/hooks/useAdminPromotions.ts": "Implements queries and mutations for managing promotions, including add, update, delete, and fetch.",
  "frontend/src/hooks/useAdminSiteSettings.ts": "Provides mutations for updating location, opening hours, and button configurations with cache invalidation.",
  "frontend/src/hooks/useAdminStatus.ts": "Provides hooks to check admin status and fetch the current user's profile via actor-based queries.",
  "frontend/src/hooks/useBackupRestore.ts": "Implements export and import data mutations using the actor, invalidating queries after import.",
  "frontend/src/hooks/useCustomPages.ts": "Fetches all custom pages or a specific page by slug from the actor.",
  "frontend/src/hooks/useGalleryData.ts": "Returns static gallery data while reserving structure for future backend integration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and context provisioning.",
  "frontend/src/hooks/useMenuData.ts": "Returns static menu categories and items with a query interface for future backend support.",
  "frontend/src/hooks/usePageSeo.ts": "Returns static SEO data for a given page key with room for backend integration.",
  "frontend/src/hooks/usePromotions.ts": "Fetches active promotions from the actor with placeholder empty data.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations for submitting contact, reservation, and catering forms and invalidating related queries.",
  "frontend/src/hooks/useSiteSettings.ts": "Fetches location, opening hours, and button configurations from the actor with fallbacks.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for themes, and global styles including a pattern utility.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup and sections describing the restaurant’s story, mission, and services.",
  "frontend/src/pages/admin/AdminPage.tsx": "Admin dashboard with authentication gate, tabbed navigation, and management panels.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with a form, location details, opening hours, and SEO/JSON‑LD setup.",
  "frontend/src/pages/CustomPage.tsx": "Loads and displays a custom CMS page by slug with SEO handling and fallback states.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery page with SEO setup and a grid of fetched gallery items.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage hero, featured categories, and highlights with SEO setup.",
  "frontend/src/pages/MenuPage.tsx": "Displays menu items with category filtering and SEO configuration.",
  "frontend/src/pages/OrderReservePage.tsx": "Provides reservation and catering request forms via tabbed UI with SEO setup.",
  "frontend/src/seo/LocalBusinessJsonLd.tsx": "Generates and injects JSON‑LD schema for restaurant business info using site settings.",
  "frontend/src/seo/seoConfig.ts": "Defines default and per‑page SEO configurations using site metadata.",
  "frontend/src/seo/useSeo.ts": "React hook that updates document title, meta tags, canonical URL, and social tags based on SEO settings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing/retrieving them in sessionStorage, and persisting or clearing values used for routing or admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing project requirements, architecture notes, existing features, and known issues, focused on a mobile-first restaurant site with admin authorization problems."
}