{
  "kind": "build_request",
  "title": "Fix admin access-code authorization so the admin dashboard stops showing Access Denied",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Implement/repair backend admin authorization so the frontend’s existing access-code flow can successfully grant admin access when the correct access code is provided, and deny access otherwise.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It still not work."
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated Internet Identity user has NOT provided the correct access code, `isCallerAdmin()` returns `false` and does not trap.",
        "When an authenticated Internet Identity user provides the correct access code \"01622610\" (via `_initializeAccessControlWithSecret(\"01622610\")`), subsequent calls to `isCallerAdmin()` return `true` for that same principal.",
        "An incorrect access code does not grant admin access and does not trap; the caller remains non-admin.",
        "Admin authorization state persists across canister upgrades (a redeploy/upgrade does not lock out the previously-authorized admin principal)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Ensure the backend method `_initializeAccessControlWithSecret(adminToken)` is safe to call during actor initialization even when the token is missing/empty/invalid, so the frontend actor creation path never fails due to a trap from this method.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It still not work."
        ]
      },
      "acceptanceCriteria": [
        "Calling `_initializeAccessControlWithSecret(\"\")` does not trap and completes successfully.",
        "Calling `_initializeAccessControlWithSecret(\"wrong\")` does not trap and completes successfully.",
        "If the frontend has no access code stored yet (empty token), the app still loads and the admin page renders the Access Denied UI instead of failing due to missing actor initialization."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Expose and wire the exact admin status API expected by the existing frontend (`isCallerAdmin()`), and ensure it reflects the backend’s stored admin authorization state produced by the access-code initialization flow.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It still not work."
        ]
      },
      "acceptanceCriteria": [
        "`isCallerAdmin()` exists on the backend canister interface and is callable as a query from the frontend.",
        "After a successful `_initializeAccessControlWithSecret(\"01622610\")`, `isCallerAdmin()` returns `true` for that principal without requiring any additional steps.",
        "`isCallerAdmin()` never traps; it always returns a boolean (false for unauthorized/non-admin callers)."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Keep all user-facing admin/auth messaging in English and preserve the current admin gating UX (Retry access check, Sign out, Return to Home, and the access-code entry panel), without editing immutable frontend hook files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It still not work."
        ]
      },
      "acceptanceCriteria": [
        "No changes are made to any immutable frontend paths listed in SYSTEM_CONTEXT (including `frontend/src/hooks/useInternetIdentity.ts(x)` and `frontend/src/hooks/useActor.ts`).",
        "The Admin Access Denied screen continues to show English text and provides: Retry access check, Sign out, Return to Home, and Enter Access Code UI.",
        "After the backend fix, entering the correct access code and reloading results in the admin dashboard rendering successfully for that principal."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend hook files: `frontend/src/hooks/useInternetIdentity.ts(x)` and `frontend/src/hooks/useActor.ts`.",
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo` (respect single-actor architecture).",
    "Use English for any user-facing text.",
    "Do not add `backend/migration.mo` unless a stable-state schema change makes it necessary under the conditional migration policy."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Implementing real-time features (WebSockets/push).",
    "Changing the public website design or content unrelated to admin authorization.",
    "Introducing external databases or multi-service architectures."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}